**Итоговое домашнее задание.**
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

**Описание:**
1. Cоздаем исходный массив строк arrayа. 
2. Заполняем массив, проходясь по каждому элементу и запрашивая у пользователя его значение. 
3. Создаем новый масси newArray той же длины, что и исходный массив, и считаем количество элементов, которые мы добавим в новый массив.
4. Проходимся по каждому элементу в исходном массиве и проверяем, меньше либо равна длина элемента 3 символам. Если это так, мы добавляем этот элемент в новый массив и увеличиваем значение count.
5. После прохождения по всем элементам исходного массива мы изменяем размер нового массива, чтобы он соответствовал количеству элементов, которые мы добавили. 



_________________________________________________________________________________
        1. Console.Write("Введите длинну массива: ");
        int n = Convert.ToInt32(Console.ReadLine());
        string[] array = new string[n];
        2. Console.WriteLine($"Введите элементы массива:");
        for (int i = 0; i < n; i++)
        {  Console.Write($"Элемент " + (i + 1) + ": ");
            array[i] = Console.ReadLine(); }
        3. string[] newArray = new string[array.Length];
        int count = 0;
        for (int i = 0; i < array.Length; i++)
        4. {   if (array[i].Length <= 3)
            { newArray[count] = array[i];
                count++; } }
        5.  Array.Resize(ref newArray, count);

