**Итоговое домашнее задание.**
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

**Описание:**
1. Cоздаем исходный массив строк arrayа. 

_________________________________________________________________________________
        1. Console.Write("Введите длинну массива: ");
        int n = Convert.ToInt32(Console.ReadLine());
        string[] array = new string[n];
